{"class_name": "Model", "config": {"name": "MyModel", "layers": [{"name": "input_96", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 227, 227, 3], "dtype": "float32", "sparse": false, "name": "input_96"}, "inbound_nodes": []}, {"name": "conv0", "class_name": "Conv2D", "config": {"name": "conv0", "trainable": true, "filters": 96, "kernel_size": [11, 11], "strides": [4, 4], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_96", 0, 0, {}]]]}, {"name": "bn0", "class_name": "BatchNormalization", "config": {"name": "bn0", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv0", 0, 0, {}]]]}, {"name": "activation_806", "class_name": "Activation", "config": {"name": "activation_806", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn0", 0, 0, {}]]]}, {"name": "max_pool0", "class_name": "MaxPooling2D", "config": {"name": "max_pool0", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_806", 0, 0, {}]]]}, {"name": "zero_padding2d_684", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_684", "trainable": true, "padding": [[2, 2], [2, 2]], "data_format": "channels_last"}, "inbound_nodes": [[["max_pool0", 0, 0, {}]]]}, {"name": "conv1", "class_name": "Conv2D", "config": {"name": "conv1", "trainable": true, "filters": 256, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_684", 0, 0, {}]]]}, {"name": "bn1", "class_name": "BatchNormalization", "config": {"name": "bn1", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "activation_807", "class_name": "Activation", "config": {"name": "activation_807", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn1", 0, 0, {}]]]}, {"name": "max_pool1", "class_name": "MaxPooling2D", "config": {"name": "max_pool1", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_807", 0, 0, {}]]]}, {"name": "zero_padding2d_685", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_685", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["max_pool1", 0, 0, {}]]]}, {"name": "conv2", "class_name": "Conv2D", "config": {"name": "conv2", "trainable": true, "filters": 384, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_685", 0, 0, {}]]]}, {"name": "bn2", "class_name": "BatchNormalization", "config": {"name": "bn2", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2", 0, 0, {}]]]}, {"name": "activation_808", "class_name": "Activation", "config": {"name": "activation_808", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_686", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_686", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_808", 0, 0, {}]]]}, {"name": "conv3", "class_name": "Conv2D", "config": {"name": "conv3", "trainable": true, "filters": 384, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_686", 0, 0, {}]]]}, {"name": "bn3", "class_name": "BatchNormalization", "config": {"name": "bn3", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3", 0, 0, {}]]]}, {"name": "activation_809", "class_name": "Activation", "config": {"name": "activation_809", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3", 0, 0, {}]]]}, {"name": "zero_padding2d_687", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_687", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_809", 0, 0, {}]]]}, {"name": "conv4", "class_name": "Conv2D", "config": {"name": "conv4", "trainable": true, "filters": 384, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_687", 0, 0, {}]]]}, {"name": "bn4", "class_name": "BatchNormalization", "config": {"name": "bn4", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv4", 0, 0, {}]]]}, {"name": "activation_810", "class_name": "Activation", "config": {"name": "activation_810", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4", 0, 0, {}]]]}, {"name": "max_pool4", "class_name": "MaxPooling2D", "config": {"name": "max_pool4", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_810", 0, 0, {}]]]}, {"name": "upsampling5", "class_name": "UpSampling2D", "config": {"name": "upsampling5", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["max_pool4", 0, 0, {}]]]}, {"name": "zero_padding2d_688", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_688", "trainable": true, "padding": [[2, 2], [2, 2]], "data_format": "channels_last"}, "inbound_nodes": [[["upsampling5", 0, 0, {}]]]}, {"name": "conv5", "class_name": "Conv2D", "config": {"name": "conv5", "trainable": true, "filters": 384, "kernel_size": [4, 4], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_688", 0, 0, {}]]]}, {"name": "bn5", "class_name": "BatchNormalization", "config": {"name": "bn5", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv5", 0, 0, {}]]]}, {"name": "activation_811", "class_name": "Activation", "config": {"name": "activation_811", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn5", 0, 0, {}]]]}, {"name": "zero_padding2d_689", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_689", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_811", 0, 0, {}]]]}, {"name": "conv6", "class_name": "Conv2D", "config": {"name": "conv6", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_689", 0, 0, {}]]]}, {"name": "bn6", "class_name": "BatchNormalization", "config": {"name": "bn6", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv6", 0, 0, {}]]]}, {"name": "activation_812", "class_name": "Activation", "config": {"name": "activation_812", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn6", 0, 0, {}]]]}, {"name": "upsampling7", "class_name": "UpSampling2D", "config": {"name": "upsampling7", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_812", 0, 0, {}]]]}, {"name": "zero_padding2d_690", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_690", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["upsampling7", 0, 0, {}]]]}, {"name": "conv7", "class_name": "Conv2D", "config": {"name": "conv7", "trainable": true, "filters": 96, "kernel_size": [2, 2], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_690", 0, 0, {}]]]}, {"name": "bn7", "class_name": "BatchNormalization", "config": {"name": "bn7", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv7", 0, 0, {}]]]}, {"name": "activation_813", "class_name": "Activation", "config": {"name": "activation_813", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn7", 0, 0, {}]]]}, {"name": "upsampling8", "class_name": "UpSampling2D", "config": {"name": "upsampling8", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_813", 0, 0, {}]]]}, {"name": "zero_padding2d_691", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_691", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["upsampling8", 0, 0, {}]]]}, {"name": "conv8", "class_name": "Conv2D", "config": {"name": "conv8", "trainable": true, "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_691", 0, 0, {}]]]}, {"name": "bn8", "class_name": "BatchNormalization", "config": {"name": "bn8", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv8", 0, 0, {}]]]}, {"name": "activation_814", "class_name": "Activation", "config": {"name": "activation_814", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn8", 0, 0, {}]]]}, {"name": "zero_padding2d_692", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_692", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_814", 0, 0, {}]]]}, {"name": "conv9", "class_name": "Conv2D", "config": {"name": "conv9", "trainable": true, "filters": 96, "kernel_size": [2, 2], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_692", 0, 0, {}]]]}, {"name": "bn9", "class_name": "BatchNormalization", "config": {"name": "bn9", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv9", 0, 0, {}]]]}, {"name": "activation_815", "class_name": "Activation", "config": {"name": "activation_815", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn9", 0, 0, {}]]]}, {"name": "upsampling10", "class_name": "UpSampling2D", "config": {"name": "upsampling10", "trainable": true, "size": [4, 4], "data_format": "channels_last"}, "inbound_nodes": [[["activation_815", 0, 0, {}]]]}, {"name": "zero_padding2d_693", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_693", "trainable": true, "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["upsampling10", 0, 0, {}]]]}, {"name": "conv10", "class_name": "Conv2D", "config": {"name": "conv10", "trainable": true, "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_693", 0, 0, {}]]]}, {"name": "bn10", "class_name": "BatchNormalization", "config": {"name": "bn10", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv10", 0, 0, {}]]]}, {"name": "activation_816", "class_name": "Activation", "config": {"name": "activation_816", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn10", 0, 0, {}]]]}, {"name": "zero_padding2d_694", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_694", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_816", 0, 0, {}]]]}, {"name": "conv11", "class_name": "Conv2D", "config": {"name": "conv11", "trainable": true, "filters": 3, "kernel_size": [2, 2], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_694", 0, 0, {}]]]}, {"name": "bn11", "class_name": "BatchNormalization", "config": {"name": "bn11", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv11", 0, 0, {}]]]}, {"name": "activation_817", "class_name": "Activation", "config": {"name": "activation_817", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn11", 0, 0, {}]]]}], "input_layers": [["input_96", 0, 0]], "output_layers": [["activation_817", 0, 0]]}, "keras_version": "2.1.1", "backend": "tensorflow"}